In [3]:
import pandas as pd

In [4]:
raw_data = {
        'Employee ID': ['1', '2', '3', '4', '5'],
        'first name': ['Diana', 'Cynthia', 'Shep', 'Ryan', 'Allen'], 
        'last name': ['Bouchard', 'Ali', 'Rob', 'Mitch', 'Steve']}
df_Engineering_dept = pd.DataFrame(raw_data, columns = ['Employee ID', 'first name', 'last name'])
df_Engineering_dept

raw_data = {
        'Employee ID': ['6', '7', '8', '9', '10'],
        'first name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'], 
        'last name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
df_Finance_dept = pd.DataFrame(raw_data, columns = ['Employee ID', 'first name', 'last name'])
df_Finance_dept

raw_data = {
        'Employee ID': ['1', '2', '3', '4', '5', '6','7', '8', '9', '10'],
        'Salary [$/hour]': [25, 35, 45, 48, 49, 32,34, 33, 34, 23]}
df_salary = pd.DataFrame(raw_data, columns = ['Employee ID','Salary [$/hour]'])
df_salary

  Employee ID  Salary [$/hour]
0           1               25
1           2               35
2           3               45
3           4               48
4           5               49
5           6               32
6           7               34
7           8               33
8           9               34
9          10               23

In [7]:
df_all=pd.concat([df_Engineering_dept,df_Finance_dept]).reset_index(drop=True)

In [8]:
df_all

  Employee ID first name  last name
0           1      Diana   Bouchard
1           2    Cynthia        Ali
2           3       Shep        Rob
3           4       Ryan      Mitch
4           5      Allen      Steve
5           6       Bill  Christian
6           7       Dina         Mo
7           8      Sarah      Steve
8           9    Heather        Bob
9          10      Holly   Michelle

In [9]:
df_salary

  Employee ID  Salary [$/hour]
0           1               25
1           2               35
2           3               45
3           4               48
4           5               49
5           6               32
6           7               34
7           8               33
8           9               34
9          10               23

In [11]:
df_merge=df_all.merge(df_salary,on="Employee ID",how="left")

In [12]:
df_merge

  Employee ID first name  last name  Salary [$/hour]
0           1      Diana   Bouchard               25
1           2    Cynthia        Ali               35
2           3       Shep        Rob               45
3           4       Ryan      Mitch               48
4           5      Allen      Steve               49
5           6       Bill  Christian               32
6           7       Dina         Mo               34
7           8      Sarah      Steve               33
8           9    Heather        Bob               34
9          10      Holly   Michelle               23

In [14]:
df_all.merge(df_salary,right_on="Employee ID",left_on="Employee ID",how="left")

  Employee ID first name  last name  Salary [$/hour]
0           1      Diana   Bouchard               25
1           2    Cynthia        Ali               35
2           3       Shep        Rob               45
3           4       Ryan      Mitch               48
4           5      Allen      Steve               49
5           6       Bill  Christian               32
6           7       Dina         Mo               34
7           8      Sarah      Steve               33
8           9    Heather        Bob               34
9          10      Holly   Michelle               23

In [19]:
df=pd.read_csv(r"C:\Users\Admin\Desktop\Saurabh\weather_data.csv")

In [20]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [26]:
df.temperature.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
Name: temperature, dtype: bool

In [27]:
df.temperature.isnull().sum()

0

In [28]:
import numpy as np

In [29]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [38]:
weather_data=[("1/1/2017",np.nan,6,"Rain"),
              ("1/2/2017",35,7,"Sunny"),
             (np.nan,np.nan,np.nan,np.nan),
             ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', np.nan, 2, 'Sunny')]
df=pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017          NaN        6.0   Rain
1  1/2/2017         35.0        7.0  Sunny
2       NaN          NaN        NaN    NaN
3  1/4/2017         24.0        7.0   Snow
4  1/5/2017         32.0        4.0   Rain
5  1/6/2017          NaN        2.0  Sunny

In [37]:
df

        day  temperature  windspeed  event
0  1/1/2017          NaN        6.0   Rain
1  1/2/2017         35.0        7.0  Sunny
2       NaN          NaN        NaN    NaN
3  1/4/2017         24.0        7.0   Snow
4  1/5/2017         32.0        4.0   Rain
5  1/6/2017          NaN        2.0  Sunny

In [40]:
df.isnull().sum()

day            1
temperature    3
windspeed      1
event          1
dtype: int64

In [41]:
df1=pd.read_excel(r"C:\Users\Admin\Desktop\Saurabh\weather_data_cities.xlsx")

In [42]:
df1

          day      city  temperature  windspeed   event
0  2017-01-01  new york         32.0        6.0    Rain
1  2017-01-02  new york         36.0        7.0   Sunny
2  2017-01-03  new york         28.0       12.0    Snow
3  2017-01-04  new york         33.0        7.0   Sunny
4  2017-01-01    mumbai         90.0        5.0   Sunny
5  2017-01-02    mumbai         85.0       12.0     Fog
6  2017-01-03    mumbai         87.0       15.0     Fog
7  2017-01-04    mumbai         92.0        5.0    Rain
8  2017-01-01     paris         45.0       20.0   Sunny
9  2017-01-02     paris         50.0       13.0  Cloudy
10 2017-01-03     paris         54.0        8.0  Cloudy
11 2017-01-04     paris         42.0       10.0  Cloudy

In [43]:
df1.shape

(12, 5)

In [45]:
 df1.city.sum()

'new yorknew yorknew yorknew yorkmumbaimumbaimumbaimumbaiparisparisparisparis'

In [46]:
df1.isnull().sum()

day            0
city           0
temperature    0
windspeed      0
event          0
dtype: int64

In [51]:
df1.sum()

C:\Users\Admin\AppData\Local\Temp\ipykernel_996\2390510930.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.sum()

city           new yorknew yorknew yorknew yorkmumbaimumbaimu...
temperature                                                674.0
windspeed                                                  120.0
event          RainSunnySnowSunnySunnyFogFogRainSunnyCloudyCl...
dtype: object

In [52]:
df1.notnull().sum()

day            12
city           12
temperature    12
windspeed      12
event          12
dtype: int64

In [68]:
print(df1["event"].value_counts())
print(df1["city"].value_counts())

Sunny     4
Cloudy    3
Rain      2
Fog       2
Snow      1
Name: event, dtype: int64
new york    4
mumbai      4
paris       4
Name: city, dtype: int64

In [66]:
df1["temperature"].min()

28.0

In [67]:
df1["temperature"].max()

92.0

In [75]:
print(df1.temperature.max())

92.0

In [82]:
df1[df1["temperature"].apply(df1.temperature.max())]

TypeError: 'float' object is not callable

In [83]:
df1[df1.temperature==df1.temperature.max()]

         day    city  temperature  windspeed event
7 2017-01-04  mumbai         92.0        5.0  Rain

In [87]:
a=df1["day"][df1.temperature==df1.temperature.max()]

In [89]:
del a['index']

KeyError: 'index'